'''
++++++++++++++++++++++++++++++++++++++++++++++++
Чтение и запись данных из файлов
++++++++++++++++++++++++++++++++++++++++++++++++
'''
from fontTools.ttx import opentypeheaderRE

'''
===============================================
1. Создайте текстовый файл lesson_15.txt со следующим содержимым:

Python – это мощный язык программирования.
Работа с файлами важна для автоматизации.
Чтение файлов в Python удобно и просто.

Напишите программу, которая полностью прочитает файл и выведет его содержимое.
===============================================
'''
# file_1 = 'lesson_15.txt'
# with open(file = file_1, mode= 'r') as f:
#     text = f.read()
# print(text)

'''
===============================================
2. Напишите программу, которая считает и выведет только первую строку из файла lesson_15.txt.
Ожидаемый вывод:
Python – это мощный язык программирования.
===============================================
'''
# file_2 = 'lesson_15.txt'
# with open(file = file_2, mode= 'r') as f2:
#     text = f2.readline()
# print(text)

"""
===============================================
3. Откройте файл lesson_15.txt и прочитайте первые 10 символов.
Ожидаемый вывод:
Python – э
===============================================
"""
# file_3 = 'lesson_15.txt'
# with open(file = file_3, mode= 'r') as f3:
#     text = f3.read(10)
# print(text)

"""
4. Прочитайте все строки файла и сохраните их в список. Затем выведите этот список.
Ожидаемый вывод:
['Python – это мощный язык программирования.\n', 'Работа с файлами важна для автоматизации.\n', 'Чтение файлов в Python удобно и просто.\n']
"""
# file_4 = 'lesson_15.txt'
# with open(file = file_4, mode= 'r') as f4:
#     text = f4.readlines()
# print(text)

"""
===============================================
5. Напишите программу, которая считает строки файла data.txt в цикле и выводит их по одной, убирая символ \n в конце.
Ожидаемый вывод:
Строка: Python – это мощный язык программирования.
Строка: Работа с файлами важна для автоматизации.
Строка: Чтение файлов в Python удобно и просто.
===============================================
"""
# file_5 = 'lesson_15.txt'
# with open(file_5, 'r') as f:
#     for line in f:
#         print('Строка:', line, end='')

"""
===============================================
6. Откройте файл data.txt, прочитайте 5 символов, затем переместите указатель в начало файла
и снова прочитайте 5 символов и выведите их.
Ожидаемый вывод:
Python
Python
===============================================
"""
# file_6 = 'lesson_15.txt'
# with open(file_5, 'r') as f:
#     text_1 = f.read(6)
#     f.seek(0)
#     text_2 = f.read(6)
#     print(text_1)
#     print(text_2)

'''
===============================================
7. Напишите программу, которая откроет файл data.txt, определит его размер (в байтах) и выведет его.
Ожидаемый вывод:
Размер файла: 128 байт  # (значение может отличаться)
===============================================
'''
# file_6 = 'lesson_15.txt'
# with open(file_6, 'r') as f:
#     f.read()
#     byte = f.tell()
#     print(f'Размер файла: {byte} байт')

"""
===============================================
8. Используйте with open(), чтобы прочитать и вывести содержимое файла data.txt.
===============================================
"""
# file_7 = 'lesson_15.txt'
# with open(file_7, 'r') as f:
#     text = f.read()
#     print(text)

"""
===============================================
9. Напишите программу, которая пытается открыть файл data.txt, прочитать его содержимое и вывести его.
Если файл не найден, программа должна вывести "Ошибка: Файл не найден".

Ожидаемый вывод (если файл есть):
Python – это мощный язык программирования.
Работа с файлами важна для автоматизации.
Чтение файлов в Python удобно и просто.

Ожидаемый вывод (если файла нет):
Ошибка: Файл не найден
===============================================
"""
# # вариант если файла нет - выведет Ошибка: Файл не найден
# try:
#     f = open('data.txt', 'r')
#     try:
#         text = f.read()
#         print(text)
#     finally:
#         f.close()
# except FileNotFoundError:
#     print('Ошибка: Файл не найден')
#
# # вариант если файла есть - выведет содержимое файла
# try:
#     f = open('lesson_15.txt', 'r')
#     try:
#         text = f.read()
#         print(text)
#     finally:
#         f.close()
# except FileNotFoundError:
#     print('Ошибка: Файл не найден')

"""
===============================================
10. Модифицируйте программу из Задания 1, добавив гарантированное закрытие файла в блоке finally.
не понял немного сути задания
в предыдущем задании и так указал в finally гарантированное закрытие файла
===============================================
"""
# file_1 = 'lesson_15.txt'
# try:
#     f = open(file_1, mode= 'r')
#     try:
#         text = f.read()
#         print(text)
#     finally:
#         f.close()
# except:
#     pass

"""
===============================================
11. Используйте with open(), чтобы безопасно открыть файл data.txt и прочитать его построчно.
Если файл не найден, выведите "Ошибка: Файл не найден".
===============================================
"""
# file_1 = 'lesson_15.txt'
# try:
#     with open(file_1, 'r') as f:
#         for line in f:
#             text = f.readline()
#             print(line, end='')
# except FileNotFoundError:
#     print("Ошибка: Файл не найден")

"""
===============================================
12. Создайте файл numbers.txt, который содержит по одному числу в каждой строке.
Напишите программу, которая читает файл, суммирует все числа и выводит их сумму.
Если файл не найден, программа должна вывести "Ошибка: Файл не найден".
===============================================
"""
# with open('number.txt', "a") as f:
#     for n in range(1,11):
#         f.write(f'{n}\n')

# try:
#     f = open('number.txt', 'r')
#     try:
#         res = 0
#         for n in f:
#             res += int(n)
#         print(res)
#     finally:
#         f.close()
#
# except FileNotFoundError:
#     print("Ошибка: Файл не найден")

"""
===============================================
13. Создайте файл log.txt.
Программа должна добавлять в него текущую дату и время при каждом запуске.
Используйте модуль datetime и режим "a".

Получение даты и времени для логирования:
import datetime
print(datetime.datetime.now().strftime("%d.%m.%Y %H:%M:%S"))

Пример содержимого файла после нескольких запусков:

2024-02-16 14:30:01 Запуск программы
2024-02-16 14:35:15 Запуск программы
2024-02-16 14:40:22 Запуск программы
===============================================
"""
import datetime
with open('log.txt', 'a') as f:
    f.write(datetime.datetime.now().strftime("%d.%m.%Y %H:%M:%S"))
    f.write(' Запуск программы\n')

with open('log.txt', 'r') as f:
    print(f.read())
