'''
++++++++++++++++++++++++++++++++++++++++++++++++
Задачи по итераторам
++++++++++++++++++++++++++++++++++++++++++++++++
'''

'''
===============================================
1. Пройти по списку с помощью итератора
Создайте итератор для списка и выведите все его элементы с использованием next().
===============================================
'''
numbers = [1, 2, 3, 4, 5, 6]
it_numbers = iter(numbers)
print(next(it_numbers))
print(next(it_numbers))
print(next(it_numbers))
print(next(it_numbers))
print(next(it_numbers))
print(next(it_numbers))

'''
===============================================
2. Итератор для строки
Используйте iter() и next() для посимвольного вывода строки.
===============================================
'''
str_str = 'Леонид'
str_str_it = iter(str_str)
print(next(str_str_it))
print(next(str_str_it))
print(next(str_str_it))
print(next(str_str_it))
print(next(str_str_it))
print(next(str_str_it))

'''
++++++++++++++++++++++++++++++++++++++++++++++++
Задачи по теме "Генераторы списков (List Comprehensions)"
++++++++++++++++++++++++++++++++++++++++++++++++
'''

'''
===============================================
1. Создайте список из квадратов чисел от 1 до N, используя list comprehension.
===============================================
'''
N = 5
result = [num ** 2 for num in range(1, N + 1)] #вводим переменную num которая является каждым числом поочереди из цикла for по диапазону
print(result)

'''
===============================================
2. Сформируйте список, содержащий только четные числа в диапазоне от -10 до 10.
===============================================
'''
lst = [n for n in range(-10, 10) if n % 2 == 0 and n != 0]
#создаем список в который попадает значение n из цикла с диапазоном -10 - 10 только если оно четное и не ноль
print(lst)

'''
===============================================
3. Дан список слов. Создайте новый список, содержащий длины всех слов, используя генератор списков.
===============================================
'''
words = ['Saratov', 'Samara', 'Stavropol', 'Rostov', 'Moscow']
words_len = [len(n) for n in words]
print(words_len)

'''
===============================================
4. Создайте список из чисел от 1 до 20, где вместо четных чисел будет "четное", а вместо нечетных — "нечетное" 
(используйте тернарный оператор)
===============================================
'''
num = ['четное' if n % 2 == 0 else 'нечетное' for n in range(1, 21)]
print(num)

'''
===============================================
5. Проверка, является ли объект итерируемым
Создайте список внутри которого 3 объекта: число, строка и список.
Создайте генератор в котором будет написано True - если объект является итерируемым или False - если нет.
===============================================
'''
lst_1 = [2, 'Saratov', [1, 2, 3]]
result = [True if type(n) == str or type(n) == list else False for n in lst_1]
print(result)