'''
++++++++++++++++++++++++++++++++++++++++++++++++
Выражения-генераторы
++++++++++++++++++++++++++++++++++++++++++++++++
'''

'''
===============================================
1. Создайте генератор, который возвращает только строки из списка:
["Python", 123, "Java", 456, "C++", 789]
Выведите все строки в одну строку через пробел.
Ожидаемый вывод:
Python Java C++
===============================================
'''
# lst = ["Python", 123, "Java", 456, "C++", 789]
# gen = (s for s in lst if isinstance(s, str))
# for x in gen:
#     print(x, end=' ')

'''
===============================================
2. Создайте генератор случайных чисел от 1 до 100 (10 чисел),
используя модуль random (попробуйте сами найти как использовать), и найдите максимальное число.
Ожидаемый вывод:
Максимальное число: 98  # (значение может отличаться)
===============================================
'''
import random
# gen_1 = (random.randint(1, 100) for x in range(11)) # - for x in range(11) просто задает количество итераций. Сами значения из диапазона не используются
# print(max(gen_1))

'''
===============================================
3. Создайте генератор, который возвращает слова из файла words.txt,
но только те, которые длиннее 5 символов.
Пример содержимого файла (words.txt):
apple banana cat elephant python
Ожидаемый вывод:
banana elephant python
===============================================
'''
# with open('word.txt', 'r') as f:
#     text = f.read().split()
# print(text)
# gen_2 = (word for word in text if len(word) > 5)
# for x in gen_2:
#     print(x, end=" ")

'''
===============================================
4. Напишите функцию-генератор, которая перебирает строки файла text.txt,
возвращая только те, которые содержат слово "Python".
Пример содержимого text.txt:
Hello world
Python is great
I love coding in Python
Java is also good
Ожидаемый вывод:
Python is great
I love coding in Python
===============================================
'''
# with open('text.txt', 'r') as f:
#     text = f.readlines()
# print(text)
# gen_3 = (line for line in text if 'Python' in line)
# for x in gen_3:
#     print(x, end='')

'''
===============================================
5. Создайте бесконечный генератор, который возвращает случайные числа от 1 до 100.
Остановите выполнение, как только сгенерируется число 50.
Ожидаемый вывод (значения могут отличаться):
23 89 17 50
===============================================
'''
# def gen_4():
#     while True:
#         r = random.randint(1, 100)
#         yield r
#         if r == 50:
#             break
# for x in gen_4():
#     print(x, end=' ')

'''
===============================================
6. Создайте функцию-генератор, которая возвращает первые N простых чисел.
Выведите первые 10 простых чисел. (на 1 и само на себя)
Ожидаемый вывод:
2 3 5 7 11 13 17 19 23 29
===============================================
'''
# def gen_5(n):
#     start = 2 # - с какого числа начнем проверять. Постепенно это значение должно увеличиваться, чтобы проверять новые числа
#     count = 0 # - счетчик найденных простоых чисел
#
#     while count < n: # - пока счетчик меньше заданного значения выполняем наш код
#         for x in range(2, start): # - задаем цикл от числа 2 до нашего
#             if start % x == 0: # - если есть хоть один делитель
#                 break # - останавливаем цикл
#         else: # - тут else выполняется если не произошел break
#             yield start # - генерируем и возвращаем наше число
#             count += 1 # - увеличиваем счетчик
#         start += 1 # - проверяем следующее число
#
# for x in gen_5(10): # -
#     print(x, end=" ") # -


'''
===============================================
7. Создайте функцию-генератор, которая имитирует загрузку данных из API.
Генератор должен возвращать строки "Получены данные 1", "Получены данные 2", …
Остановите генерацию после 5 вызовов next().
Ожидаемый вывод:
Получены данные 1
Получены данные 2
Получены данные 3
Получены данные 4
Получены данные 5
===============================================
'''
# def gen_6():
#     count = 1
#     while count <= 5:
#         yield f'Получены данные {count}'
#         count += 1
#
# # for g in gen_6(5):
# #     print(g)
# g = gen_6()
# print(next(g))
# print(next(g))
# print(next(g))
# print(next(g))
# print(next(g))
# # print(next(g)) # - уже не выполнится

'''
===============================================
8. Используйте map() вместе с лямбда-функцией, чтобы для каждого числа из пользовательского ввода
(числа, разделённые пробелами) вычислить его квадрат.
Результатом должно быть преобразование входной строки в список квадратов.
===============================================
'''
# num = input('Введите несколько чисел через пробел:')
# lst = num.split()
# print(lst)
#
# res = map(lambda x: int(x) ** 2, lst)
# print(list(res))

'''
===============================================
9. Напишите программу, которая с помощью map() и метода строк upper преобразует список названий городов к верхнему регистру.
Например, преобразуйте список ["Москва", "Санкт-Петербург", "Казань"] в ["МОСКВА", "САНКТ-ПЕТЕРБУРГ", "КАЗАНЬ"].
===============================================
'''
# cities = ["Москва", "Санкт-Петербург", "Казань"]
#
# res = map(lambda str_1: str_1.upper(), cities)
#
# print(list(res))

'''
===============================================
10. Используя filter(), оставьте в списке только те числа, которые делятся на 3 и на 5 одновременно.
Дан список: [15, 30, 45, 22, 60, 77, 90, 100].
===============================================
'''
# lst = [15, 30, 45, 22, 60, 77, 90, 100]
# res = filter(lambda x: x % 3 == 0 and x % 5 == 0, lst)
# print(list(res))

'''
===============================================
11. Используя filter(), получите из списка только строки, содержащие хотя бы одну цифру.
Дан список: ["hello", "world42", "python3", "abc", "123", "data1science"].
===============================================
'''
# lst_1 = ["hello", "world42", "python3", "abc", "123", "data1science"]
# def has_digit(n):
#     for x in n:
#         if x.isdigit():
#             return True
#     else:
#         return False
# res = filter(has_digit, lst_1)
# print(list(res))

'''
===============================================
12. Используйте zip() и dict(), чтобы создать словарь, в котором:
Ключи – это названия стран
Значения – их столицы
Исходные списки:
countries = ["Россия", "Франция", "Германия"]
capitals = ["Москва", "Париж", "Берлин"]
Результат должен быть таким:
{"Россия": "Москва", "Франция": "Париж", "Германия": "Берлин"}
Подсказка: zip объект можно сразу преобразовать в словарь, если в zip преобразовали 2 итерируемых объекта.
===============================================
'''
# countries = ["Россия", "Франция", "Германия"]
# capitals = ["Москва", "Париж", "Берлин"]
# res = zip(countries, capitals)
# print(dict(res))

'''
===============================================
13. Используйте zip(*iterable), чтобы выполнить обратное преобразование списка кортежей:
data = [(1, 'a'), (2, 'b'), (3, 'c')]
Распакуйте его в два отдельных списка:
[1, 2, 3]
['a', 'b', 'c']
===============================================
'''
# data = [(1, 'a'), (2, 'b'), (3, 'c')]
# res_1, res_2 = zip(*data)
# print(list(res_1))
# print(list(res_2))

'''
===============================================
14. Дан список имен names. Отсортируйте его так, чтобы сначала шли имена с заглавной буквы, а затем – с маленькой.
names = ["петр", "Иван", "мария", "Анна"]
Ожидаемый результат:
["Анна", "Иван", "мария", "петр"]
Подсказка: вспомните как найти id буквы чтобы понять какая больше заглавная или строчная =)
===============================================
'''
# names = ["петр", "Иван", "мария", "Анна"]
# # - строчные питон считает большим значением
# print(ord('A'))
# print(ord('а'))
# print(ord('И'))
# print(ord('и'))
# # - следовательно вот здесь при сортировке по умолчанию от меньшего к большему будут сначала заглавные, потом строчные
# res = sorted(names)
# print(res)

'''
===============================================
15. Дан список кортежей products, где первый элемент – название товара, второй – цена.
 Отсортируйте его по цене (по возрастанию).

products = [("Телефон", 500), ("Ноутбук", 1000), ("Планшет", 700)]
Ожидаемый результат:

[("Телефон", 500), ("Планшет", 700), ("Ноутбук", 1000)]
===============================================
'''
products = [("Телефон", 500), ("Ноутбук", 1000), ("Планшет", 700)]
res = sorted(products, key=lambda x: x[1])
"""
key  это функция, которая говорит Python по какому значению сортировать
Python берёт каждый элемент списка, пропускает через эту функцию и сортирует по результату.
То есть в функцию попадает каждый элемент списка (то есть кортеж) и из него берется элемент с индексом 1 и по нему сортируется
"""
print(list(res))








